In [179]:
#API 1 _ MACHINE LEARNING
#AUTHOR: Marce Martinez

#Importacion de libreria Pandas para analisis y manipulacion de data frame.
import pandas as pd

# Lectura del archivo Excel desde la URL y lo carga en un DataFrame llamado data.
url = 'https://github.com/ml008008/Repo1/raw/main/titanic_M1.xlsx'
data = pd.read_excel(url)
data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,2113375.0,B5,S,2,NaN,"St Louis, MO"
1,1.0,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,1515500.0,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,1515500.0,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,1515500.0,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,1515500.0,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [180]:
#Descripcion de la cantidad de valores faltantes para cada columna:
missing_values = data.isnull().sum()
print("Cantidad de valores faltantes por columna:\n", missing_values)

Cantidad de valores faltantes por columna:
 pclass         76
survived        0
name            0
sex             0
age           239
sibsp           0
parch           0
ticket          0
fare            0
cabin         927
embarked        2
boat          751
body         1110
home.dest     475
dtype: int64

In [181]:
#Se completan los valores faltantes en la columna 'Pclass' con 2:
data['pclass'] = data['pclass'].fillna(2)

In [182]:
#Proceso de verificacion

# a) Verificar la cantidad de valores faltantes en 'Pclass' después de la imputación
missing_pclass_after = data['pclass'].isnull().sum()
print("Cantidad de valores faltantes en 'Pclass' después de la imputación:", missing_pclass_after)

Cantidad de valores faltantes en 'Pclass' después de la imputación: 0

In [183]:

# b) Verificar que no hay valores faltantes en 'Pclass'
if missing_pclass_after == 0:
    print("Todos los valores faltantes en 'Pclass' han sido reemplazados con 2.")
else:
    print("Aún hay valores faltantes en 'Pclass'.")

Todos los valores faltantes en 'Pclass' han sido reemplazados con 2.

In [184]:

# c) Revisar los valores únicos en la columna 'Pclass'
unique_pclass_values = data['pclass'].unique()
print("Valores únicos en la columna 'Pclass':", unique_pclass_values)

Valores únicos en la columna 'Pclass': [1. 2. 3.]

In [185]:
#Imputacion de valores faltantes en la columna 'sex':

unique_sex_values = data['sex'].unique()
print("Valores únicos en la columna 'sex' antes de la imputación:\n", unique_sex_values)

data['sex'] = data['sex'].fillna('unknown')
data['sex'] = data['sex'].replace('unknown', 'male')
# Muestra los valores únicos en la columna 'Sex' antes de la imputación.
# Rellena los valores faltantes con 'unknown'.
# Reemplaza 'unknown' con 'male'.

Valores únicos en la columna 'sex' antes de la imputación:
 ['female' 'male' 'Hombre' 'Mujer']

In [186]:
#Se rellenan los valores faltantes en la columna 'Age' con el promedio de edad:
mean_age = data['age'].mean()

print(mean_age)

30.02627551020408

In [187]:
#Validacion de calculo de media
data.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1219.000000,1219.000000,980.000000,1219.000000,1219.000000,1.219000e+03,109.000000
mean,2.242822,0.394586,30.026276,0.514356,0.400328,3.499074e+05,156.091743
std,0.845215,0.488962,14.465674,1.066930,0.886238,5.320825e+05,93.785269
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000e+00,4.000000
25%,1.000000,0.000000,21.000000,0.000000,0.000000,7.925000e+04,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,1.524580e+05,149.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,3.300000e+05,236.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,5.123292e+06,327.000000

In [188]:
data['age'] = data['age'].fillna(mean_age)
print(data['age'])

0       29.000000
1        0.916700
2        2.000000
3       30.000000
4       25.000000
          ...
1214    30.026276
1215    30.026276
1216    30.026276
1217    19.000000
1218    30.000000
Name: age, Length: 1219, dtype: float64

In [189]:
#Validacion de reemplazo de valores faltantes de columna age con media = 30.026275510204076


# c) Verificar la cantidad de valores faltantes en 'Age' después de la imputación
missing_age_after = data['age'].isnull().sum()
print("Cantidad de valores faltantes en 'age' después de la imputación:", missing_age_after)

# d) Asegurarse de que todos los valores faltantes han sido reemplazados
if missing_age_after == 0:
    print("Todos los valores faltantes en 'age' han sido reemplazados con el promedio de edad.")
else:
    print("Aún hay valores faltantes en 'age'.")

Cantidad de valores faltantes en 'age' después de la imputación: 0
Todos los valores faltantes en 'age' han sido reemplazados con el promedio de edad.

In [190]:
#Exploracion de valores perdidos dentro de embarked andtes de realizar los cambios solicitados
missing_values = data.isnull().sum()
print("Cantidad de valores faltantes por columna antes de la imputación:\n", missing_values)

Cantidad de valores faltantes por columna antes de la imputación:
 pclass          0
survived        0
name            0
sex             0
age             0
sibsp           0
parch           0
ticket          0
fare            0
cabin         927
embarked        2
boat          751
body         1110
home.dest     475
dtype: int64

In [191]:
#Finalmmente se muestra la asignacion de el valor 's' a los valores faltantes en la columna 'Embarked':
data['embarked'] = data['embarked'].fillna('s')

In [192]:
#Validacion de cambios aplicados en embarked
# Contar valores faltantes después de la imputación
missing_embarked_after = data['embarked'].isnull().sum()
print("Cantidad de valores faltantes en 'embarked' después de la imputación:", missing_embarked_after)

# Asegurarse de que no hay valores faltantes en 'Embarked'
if missing_embarked_after == 0:
    print("Todos los valores faltantes en 'embarked' han sido reemplazados con 'S'.")
else:
    print("Aún hay valores faltantes en 'embarked'.")

# Revisar los valores únicos en la columna 'Embarked'
unique_embarked_values = data['embarked'].unique()
print("Valores únicos en la columna 'Embarked':", unique_embarked_values)

Cantidad de valores faltantes en 'embarked' después de la imputación: 0
Todos los valores faltantes en 'embarked' han sido reemplazados con 'S'.
Valores únicos en la columna 'Embarked': ['S' 'C' 's' 'Q']